###  जादूगर 	

कम  = 1
ज्यादा  = 1000

छापो(" १  से  १००० के बीच कोई भी एक संख्या दीजिए . मई आपका मन पढ़कर वो संख्या बताऊँगा , बस १० सवालों मई ")

## ये सवाल नो है 
सवाल_नो  = 1
जब_तक  कम  < ज्यादा :
    छापो (कम ,ज्यादा )
    ## you will realise that you need the "+1" below...
    बीच  = (कम  + ज्यादा )//2 + 1
    परिणाम  = input("%d: क्या आपकी संख्या  %d से कम हु (y/n)?" % (सवाल_नो , बीच ))
    अगर  परिणाम.छोटा ()[0] == 'y':
        ज्यादा  = बीच  -1
    अन्यथा :
        कम  = बीच 
    सवाल_नो = सवाल_नो + 1

छापो ("आपकी संख्या है :", कम)
    